<template>
    <div>

        <div class="section">
            <div class="container">
                <div class="columns">
                    <div class="column" v-if="small"><button class="button is-primary mb-3" @click="setShow"><b-icon
                                icon="dots-horizontal">
                            </b-icon></button></div>
                    <div class="column scrollable is-2" v-if="!small || show">

                        <aside class="menu mb-5">
                            <p class="menu-label">General</p>
                            <ul class="menu-list">
                                <li><a>Dashboard</a></li>
                                <li><a>Customers</a></li>
                            </ul>
                            <p class="menu-label">Administration</p>
                            <ul class="menu-list">
                                <li><a>Team Settings</a></li>
                                <li>
                                    <a class="is-active">Manage Your Team</a>
                                    <ul>
                                        <li><a>Members</a></li>
                                        <li><a>Plugins</a></li>
                                        <li><a>Add a member</a></li>
                                    </ul>
                                </li>
                                <li><a>Invitations</a></li>
                                <li><a>Cloud Storage Environment Settings</a></li>
                                <li><a>Authentication</a></li>
                            </ul>
                            <ul class="menu-list">
                                <li><a>Team Settings</a></li>
                                <li>
                                    <a class="is-active">Manage Your Team</a>
                                    <ul>
                                        <li><a>Members</a></li>
                                        <li><a>Plugins</a></li>
                                        <li><a>Add a member</a></li>
                                    </ul>
                                </li>
                                <li><a>Invitations</a></li>
                                <li><a>Cloud Storage Environment Settings</a></li>
                                <li><a>Authentication</a></li>
                            </ul>


                            <p class="menu-label">Transactions</p>
                            <ul class="menu-list">
                                <li><a>Payments</a></li>
                                <li><a>Transfers</a></li>
                                <li><a>Balance</a></li>
                            </ul>
                            <p class="menu-label">General</p>
                            <ul class="menu-list">
                                <li><a>Dashboard</a></li>
                                <li><a>Customers</a></li>
                            </ul>
                            <p class="menu-label">General</p>
                            <ul class="menu-list">
                                <li><a>Dashboard</a></li>
                                <li><a>Customers</a></li>
                            </ul>
                        </aside>
                    </div>
                    <div class="column is-10 content">

                        <h2 class="title is-2">Страница курса</h2>

                        <p>
                            Повседневная практика показывает, что дальнейшее развитие различных форм деятельности
                            способствует подготовки и реализации форм развития. Равным образом реализация намеченных
                            плановых заданий позволяет выполнять важные задания по разработке новых предложений.

                            Задача организации, в особенности же консультация с широким активом требуют определения и
                            уточнения модели развития. Разнообразный и богатый опыт постоянное
                            информационно-пропагандистское обеспечение нашей деятельности в значительной степени
                            обуславливает создание существенных финансовых и административных условий. Товарищи!
                            укрепление
                            и развитие структуры способствует подготовки и реализации дальнейших направлений развития.
                            Значимость этих проблем настолько очевидна, что реализация намеченных плановых заданий
                            представляет собой интересный эксперимент проверки систем массового участия.

                            С другой стороны консультация с широким активом позволяет оценить значение дальнейших
                            направлений развития. Товарищи! сложившаяся структура организации в значительной степени
                            обуславливает создание соответствующий условий активизации.

                            С другой стороны сложившаяся структура организации требуют определения и уточнения
                            направлений
                            прогрессивного развития. С другой стороны постоянное информационно-пропагандистское
                            обеспечение
                            нашей деятельности требуют от нас анализа существенных финансовых и административных
                            условий.

                            Таким образом новая модель организационной деятельности играет важную роль в формировании
                            позиций, занимаемых участниками в отношении поставленных задач. Разнообразный и богатый опыт
                            реализация намеченных плановых заданий в значительной степени обуславливает создание систем
                            массового участия. Равным образом реализация намеченных плановых заданий позволяет выполнять
                            важные задания по разработке систем массового участия.

                            Таким образом постоянный количественный рост и сфера нашей активности играет важную роль в
                            формировании направлений прогрессивного развития. Товарищи! реализация намеченных плановых
                            заданий позволяет выполнять важные задания по разработке соответствующий условий
                            активизации.
                            Значимость этих проблем настолько очевидна, что консультация с широким активом влечет за
                            собой
                            процесс внедрения и модернизации новых предложений. Разнообразный и богатый опыт сложившаяся
                            структура организации представляет собой интересный эксперимент проверки систем массового
                            участия. Идейные соображения высшего порядка, а также начало повседневной работы по
                            формированию
                            позиции обеспечивает широкому кругу (специалистов) участие в формировании форм развития.
                            Товарищи! начало повседневной работы по формированию позиции способствует подготовки и
                            реализации дальнейших направлений развития.

                            Задача организации, в особенности же постоянное информационно-пропагандистское обеспечение
                            нашей
                            деятельности позволяет оценить значение позиций, занимаемых участниками в отношении
                            поставленных
                            задач. Задача организации, в особенности же консультация с широким активом играет важную
                            роль в
                            формировании позиций, занимаемых участниками в отношении поставленных задач. Таким образом
                            рамки
                            и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании
                            позиций, занимаемых участниками в отношении поставленных задач. Повседневная практика
                            показывает, что консультация с широким активом требуют от нас анализа направлений
                            прогрессивного
                            развития.

                            Повседневная практика показывает, что новая модель организационной деятельности способствует
                            подготовки и реализации модели развития. С другой стороны дальнейшее развитие различных форм
                            деятельности представляет собой интересный эксперимент проверки дальнейших направлений
                            развития.
                            Разнообразный и богатый опыт постоянное информационно-пропагандистское обеспечение нашей
                            деятельности позволяет оценить значение существенных финансовых и административных условий.
                            С
                            другой стороны сложившаяся структура организации представляет собой интересный эксперимент
                            проверки соответствующий условий активизации. Значимость этих проблем настолько очевидна,
                            что
                            консультация с широким активом обеспечивает широкому кругу (специалистов) участие в
                            формировании
                            дальнейших направлений развития. С другой стороны начало повседневной работы по формированию
                            позиции обеспечивает широкому кругу (специалистов) участие в формировании новых предложений.

                            Повседневная практика показывает, что постоянный количественный рост и сфера нашей
                            активности
                            способствует подготовки и реализации соответствующий условий активизации. Идейные
                            соображения
                            высшего порядка, а также рамки и место обучения кадров требуют от нас анализа существенных
                            финансовых и административных условий.

                            Таким образом рамки и место обучения кадров обеспечивает широкому кругу (специалистов)
                            участие в
                            формировании существенных финансовых и административных условий. Задача организации, в
                            особенности же новая модель организационной деятельности способствует подготовки и
                            реализации
                            соответствующий условий активизации. Товарищи! дальнейшее развитие различных форм
                            деятельности
                            позволяет выполнять важные задания по разработке новых предложений. Равным образом
                            укрепление и
                            развитие структуры способствует подготовки и реализации соответствующий условий активизации.

                            Повседневная практика показывает, что дальнейшее развитие различных форм деятельности
                            способствует подготовки и реализации форм развития. Равным образом реализация намеченных
                            плановых заданий позволяет выполнять важные задания по разработке новых предложений.

                            Задача организации, в особенности же консультация с широким активом требуют определения и
                            уточнения модели развития. Разнообразный и богатый опыт постоянное
                            информационно-пропагандистское обеспечение нашей деятельности в значительной степени
                            обуславливает создание существенных финансовых и административных условий. Товарищи!
                            укрепление
                            и развитие структуры способствует подготовки и реализации дальнейших направлений развития.
                            Значимость этих проблем настолько очевидна, что реализация намеченных плановых заданий
                            представляет собой интересный эксперимент проверки систем массового участия.

                            С другой стороны консультация с широким активом позволяет оценить значение дальнейших
                            направлений развития. Товарищи! сложившаяся структура организации в значительной степени
                            обуславливает создание соответствующий условий активизации.

                            С другой стороны сложившаяся структура организации требуют определения и уточнения
                            направлений
                            прогрессивного развития. С другой стороны постоянное информационно-пропагандистское
                            обеспечение
                            нашей деятельности требуют от нас анализа существенных финансовых и административных
                            условий.

                            Таким образом новая модель организационной деятельности играет важную роль в формировании
                            позиций, занимаемых участниками в отношении поставленных задач. Разнообразный и богатый опыт
                            реализация намеченных плановых заданий в значительной степени обуславливает создание систем
                            массового участия. Равным образом реализация намеченных плановых заданий позволяет выполнять
                            важные задания по разработке систем массового участия.

                            Таким образом постоянный количественный рост и сфера нашей активности играет важную роль в
                            формировании направлений прогрессивного развития. Товарищи! реализация намеченных плановых
                            заданий позволяет выполнять важные задания по разработке соответствующий условий
                            активизации.
                            Значимость этих проблем настолько очевидна, что консультация с широким активом влечет за
                            собой
                            процесс внедрения и модернизации новых предложений. Разнообразный и богатый опыт сложившаяся
                            структура организации представляет собой интересный эксперимент проверки систем массового
                            участия. Идейные соображения высшего порядка, а также начало повседневной работы по
                            формированию
                            позиции обеспечивает широкому кругу (специалистов) участие в формировании форм развития.
                            Товарищи! начало повседневной работы по формированию позиции способствует подготовки и
                            реализации дальнейших направлений развития.

                            Задача организации, в особенности же постоянное информационно-пропагандистское обеспечение
                            нашей
                            деятельности позволяет оценить значение позиций, занимаемых участниками в отношении
                            поставленных
                            задач. Задача организации, в особенности же консультация с широким активом играет важную
                            роль в
                            формировании позиций, занимаемых участниками в отношении поставленных задач. Таким образом
                            рамки
                            и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании
                            позиций, занимаемых участниками в отношении поставленных задач. Повседневная практика
                            показывает, что консультация с широким активом требуют от нас анализа направлений
                            прогрессивного
                            развития.

                            Повседневная практика показывает, что новая модель организационной деятельности способствует
                            подготовки и реализации модели развития. С другой стороны дальнейшее развитие различных форм
                            деятельности представляет собой интересный эксперимент проверки дальнейших направлений
                            развития.
                            Разнообразный и богатый опыт постоянное информационно-пропагандистское обеспечение нашей
                            деятельности позволяет оценить значение существенных финансовых и административных условий.
                            С
                            другой стороны сложившаяся структура организации представляет собой интересный эксперимент
                            проверки соответствующий условий активизации. Значимость этих проблем настолько очевидна,
                            что
                            консультация с широким активом обеспечивает широкому кругу (специалистов) участие в
                            формировании
                            дальнейших направлений развития. С другой стороны начало повседневной работы по формированию
                            позиции обеспечивает широкому кругу (специалистов) участие в формировании новых предложений.

                            Повседневная практика показывает, что постоянный количественный рост и сфера нашей
                            активности
                            способствует подготовки и реализации соответствующий условий активизации. Идейные
                            соображения
                            высшего порядка, а также рамки и место обучения кадров требуют от нас анализа существенных
                            финансовых и административных условий.

                            Таким образом рамки и место обучения кадров обеспечивает широкому кругу (специалистов)
                            участие в
                            формировании существенных финансовых и административных условий. Задача организации, в
                            особенности же новая модель организационной деятельности способствует подготовки и
                            реализации
                            соответствующий условий активизации. Товарищи! дальнейшее развитие различных форм
                            деятельности
                            позволяет выполнять важные задания по разработке новых предложений. Равным образом
                            укрепление и
                            развитие структуры способствует подготовки и реализации соответствующий условий активизации.
                        </p>

                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<style scoped>
@media screen and (min-width: 768px) {
    .scrollable {
        height: 100%;
        position: sticky;
        top: 3.2rem;
    }

    .content {
        padding: 0px 48px;
    }

}

.scrollable {
    height: calc(90vh - 87.911px);
    overflow-y: auto;

}
</style>

<script>

export default {
    data: () => ({
        small: false,
        show: false
    }),
    created() {
        window.addEventListener('resize', this.onResize);
        this.onResize();
    },
    destroyed() {
        window.removeEventListener('resize', this.onResize)
    },
    methods: {
        onResize() {
            this.small = window.innerWidth <= 768;
        },
        setShow() {
            if (this.show) {
                this.show = false
            }
            else {
                this.show = true
            }
        }
    }
}


</script>
